GIT - 프로그램의 소스 코드 관리를 위한 분산 버전 관리 시스템
개발 목적 -리누스 토르발스가 리눅스 커널 개발에 이용하려고 개발 -> 현재는 다른 곳에도 널리 사용
성능 - 코드작업에 대해 기록,추적이 가능한 정보들을 가지고 있다.
명령어 -pull ,clone(프로젝트 다운) ,init(시작),commit 등

Repository - 응용시스템 개발에 관련된 정보를 보관하는 데이터베이스(저장소)
개발 목적-분산되어 있는 각종 정보들을 관리하기
위한 목적, 최근 전자상거래나 지식관리 등 정보시스템 간의 통합관리가 요구되는 시스템 구축 필요 -> 중요성 커짐
성능 - 각종 정보의 통합관리,유지보수
사용자가 직접 자료검색을 할 수도 있고 프로그램을 이용할 수도 있다. 

add - 합을 구하거나 새로운 것을 추가하는 연산
사용법 예시 - git add [파일](새로운 파일을 추가하거나 존재하는 파일을 스테이징하고 커밋하기)

commit - 트랜잭션의 내용 업데이트를 영구적으로 확...
